var app = new Vue({
    el: '#app',
    data : {
        categories : {
            "financial_issues" : {
                "limo commission issue" : [
                    `ازيك يا كابتن, تم احتساب عمولة المكتب بشكل صحيح,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جارى العمل على حل المشكلة وسيتم اضافة المستحقات بواقع مبلغ (قيمة المبلغ)، ويمكن سحب جميع المستحقات بالدورة الجديدة,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن عمولة الوكيل ثابتة ولا تتغير وهي كالاتي,(35 جنيه) إذا كان عائد الكابتن 100-500 جنيه,(50 جنيه) إذا كان عائد الكابتن 500 جنيه فيما أكثر,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "financial issue with supplier": [
                    `ازيك يا كابتن, تم إرسال الشكوي لقسم المكاتب وجارى العمل علي حلها مع المكتب,شكراً لثقتك, يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ],
                "smart wallet issue": [
                    `ازيك يا كابتن,برجاء الحضور لمقر الشركة والتوجه لمندوب البنك لدينا لإستكمال إنشاء المحفظة حتى يتسنى لنا ربطها بحساب الكابتن وتحويل مستحقاته ونشكركم الثقة,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة والدعم,https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جارى العمل على المشكلة وسوف يتم تحويل جميع المستحقات بواقع مبلغ (قيمة المبلغ) في خلال أسبوع,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,خطوات سحب مبلغ من المحفظة الذكية:,- قم بزيارة اى ماكينة ATM CIB ,- قم باختيار (سحب بدون بطاقات) على اليسار.,- ثم قم باختيار (المحفظة الذكية).,- قم بادخال رقم الهاتف ثم رقم المحفظة السرى ثم أدخل المبلغ.,- قم باختيار (لا) عند طلب رقم متغير. ,- تقوم الماكينة بارسال رقم سرى برسالة نصية على الهاتف فى الحال,- سنقوم بتكرار العملية من البداية ثم اختيار  (نعم) عند طلب رقم متغير. ,- قم بكتابة الرقم المتغير وتكمله البيانات المطلوبة وسيتم سحب المبلغ.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,برجاء التواصل مع البنك من خلال الرقم 19716 وتحديث بيانات المحفظة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن سياسة الشركة والذي يتفق عليها الجميع هي إحلال جميع المبالغ المالية التي مر عليها 3 أشهر فيما أكثر و لتجنب هذه المشكلة في المستقبل برجاء عدم الانتظار على أي مستحقات مالية أكثر من شهر.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                    `ازيك يا كابتن,برجاء الحضور لمقر الشركة والتوجه لمندوب البنك لدينا لإستكمال إنشاء المحفظة حتى يتسنى لنا ربطها بحساب الكابتن وتحويل مستحقاته ونشكركم الثقة,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة والدعم,https://goo.gl/FQgfks,`,
                ]
            },
            "bonus_and_guarantee_issue": {
                "weekly bonus issue" : [
                    `ازيك يا كابتن,بالفعل تم إحتساب البونص الاسبوعي لدورة (تاريخ الدورة). يمكنكم التأكد من البيانات فى صفحة الكابتن بالتعليق الموجود داخل خانة البونص فى الدورة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,لم يتم إحتساب البونص الاسبوعي لدورة (تاريخ الدورة) لعدم تحقيق الشروط المطلوبة وهي ......... و الشروط المحققة ..........,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جاري العمل علي حل مشكلة البونص الإسبوعي وسيتم إضافته بقيمة (قيمة المبلغ) علي الدورة الجديدة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,نأسف ولكنك ليس من الكباتن المؤهلين للبونص,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,نأسف ولكنك ليس من الكباتن المؤهلين للبونص. عشان توصلك رسائل البونص الإسبوعي, يجب إتباع الأتي:,1-التأكد من الإستمرارية في العمل مع كريم.,2-التأكد من الحفاظ على التقييم والعمل على رفعه.,3-قبول أكبر عدد من الطلبات.,4-الإتاحة أكثر عدد ساعات ممكنة.,5-تجنب أي رحلات مكررة مع نفس العميل.,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (مشكلة بونص/جرانتي) ثم اختيار (البونص الأسبوعي) ومن ثم رفع كلاً من (تاريخ انتهاء الدورة - مشكلة الكابتن).,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "weekly guarantee issue" : [
                    `ازيك يا كابتن,بالفعل تم إحتساب الجارانتى الاسبوعي لدورة (تاريخ الدورة). يمكنكم التأكد من البيانات فى صفحة الكابتن بالتعليق الموجود داخل خانة الجارانتي فى الدورة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,لم يتم إحتساب الجارانتى الاسبوعي لدورة (تاريخ الدورة) لعدم تحقيق الشروط المطلوبة وهي ......... و الشروط المحققة ..........,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfk,`,
                    `ازيك يا كابتن,جاري العمل علي حل مشكلة الجارانتى الإسبوعي وسيتم إضافته بقيمة (قيمة المبلغ) علي الدورة الجديدة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى الانتظار وسوف يتم تحويل قيمة البونص الأسبوعي تلقائياً في حال تحقيق الكابتن لشروطه ونشكركم الثقة,كما يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:,https://goo.gl/FQgfks,`,
                ],
                "daily guarantee issue" : [
                    `ازيك يا كابتن,تم احتساب الجارانتي بالفعل ليوم (تاريخ اليوم). يمكنكم التاكد من البيانات فى صفحة الكابتن بالتعليق الموجود داخل خانه ,الجارانتي فى الدورة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه لم يتم إحتساب الجارانتى ليوم (تاريخ اليوم) لعدم تحقيق الشروط المطلوبة وهي ......... و الشروط المحققة ..........,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جاري العمل علي حل مشكلة الجارانتى اليومي وسيتم إضافته بقيمة (قيمة المبلغ) علي الدورة الجديدة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,تم احتساب الجارانتي ليوم (تاريخ اليوم) بواقع مبلغ (قيمة المبلغ) ويمكنكم التاكد من التعديل فى صفحة الكابتن,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن العائد الكلي للكابتن من الرحلات أكبر من قيمة الجرانتي بين الساعة (...-...) لذا لن يتم احتساب مبالغ إضافية ونشكركم الثقة,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                    `ازيك يا كابتن,يرجى العلم أن تاريخ الجارانتي المرسل غير صحيح (التاريخ),برجاء التأكد من التاريخ الصحيح وإرساله مرة أخرى,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "exceptional bonus issue" : [
                    `ازيك يا كابتن,بالفعل تم إحتساب البونص الإستثنائى يمكنكم التأكد من البيانات فى صفحة الكابتن بالتعليق الموجود داخل خانة البونص فى الدورة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,لم يتم إحتساب البونص الإستثنائي لعدم تحقيق الشروط المطلوبة وهي .........و الشروط المحققة ..........,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جاري العمل علي حل مشكلة البونص الإستثنائي وسيتم إضافة المبلغ علي الدورة الجديدة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,نأسف ولكنك ليس من الكباتن المؤهلين للبونص الإستثنائي,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ],
                "Referral Bonus" : [
                    `ازيك يا كابتن,تم إحتساب بونص الترشيح بالفعل يمكنكم التأكد من البيانات داخل صفحة الكابتن.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,للأسف لم يتم إحتساب بونص الترشيح لعدم تحقيق الكابتن الجديد للشروط المطلوبة وهي …...,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,لا يوجد ترشيح بالبيانات المرسلة. برجاء التأكد من إدخال بيانات الكابتن المرشح بطريقة صحيحة وإن كانت صحيحة فيرجى العلم أنه ليس هناك ترشيح على قاعدة بيانات كريم باسم الكابتن,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جاري العمل علي حل مشكلة بونص الترشيح وسيتم إضافة المبلغ علي الدورة الجديدة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن قيمة بونص الترشيح هي (150 جنيه) وشروطه كاللآتي:,20 رحلة محققة في أول 10 أيام من تاريخ انضمام الكابتن وبداية عمله.,كما ينوه على أن نظام البونص الترشيحي الإستثنائي القائم يبدأ في (1/3/2018) وينتهي في (31/3/2018),شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ],
                "Welcome Bonus" : [
                    `ازيك يا كابتن,تم إحتساب البونص الترحيبي بالفعل يمكنكم التأكد من البيانات داخل صفحة الكابتن.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,للأسف لم يتم إحتساب البونص الترحيبي لعدم تحقيق الشروط المطلوبة وهي ...........,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,جاري العمل علي حل مشكلة البونص الترحيبي وسيتم إضافة المبلغ علي الدورة الجديدة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم إلغاء نظام البونص الترحيبي والعمل به بداية من 1/11/2017,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ]
            },
            "adma_and_trips_issues": {
                "trip pricing issues":[
                    `ازيك يا كابتن,يرجى العلم أنه تم مراجعة الرحلة رقم (رقم الرحلة) وليس هناك أي مشكلة. الرحلة محسوبة بدقة بالفعل,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن رقم الرحلة المرسل غير صحيح (رقم الرحلة),برجاء التأكد من الرقم الصحيح وإرساله مرة أخرى,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم مراجعة الرحلة رقم (رقم الرحلة) وينوه على أنه تم إضافة مبلغ (قيمة المبلغ) وتعويض الكابتن.,يمكنكم التأكد من البيانات فى صفحة الكابتن,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (مشكلة رحلة) ثم اختيار (مشكلة في المبلغ المحصل) ومن ثم رفع كلاً من (مشكلة الرحلة - رقم الرحلة).,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "collected money issue":[
                    `ازيك يا كابتن,يرجى العلم أنه تم مراجعة الرحلة رقم (رقم الرحلة) وسيتم احتساب الفرق في قيمة الرحلة,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم مراجعة الرحلة رقم (رقم الرحلة) وتم احتساب الفرق في قيمة الرحلة بقيمة (قيمة المبلغ),شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم مراجعة الرحلة رقم (رقم الرحلة) وتم تصحيح القيمة والتدقيق,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "adma issues":[
                    `ازيك يا كابتن,يرجى اتباع الاتى,1) فتح الاعدادات واختيار ""حول الهاتف"" اسفل الاعدادت,2) الضغط على ( رقم الاصدار) خمس مرات متتالية,3) والرجوع الى الاعادات و الضغط على (مطور البرامج) ثم اختيار (mock location),4) فتح التطيبقات وقم بازالة البرامج التى تم تنزليها وتستخدم خاصية ال GPS,سيتم فتح البرنامج ولن تظهر مشكلة ال GPS مرة أخرى,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,تم أعادة تنشيط حسابك اذا لم يتم تلاقى طلبات ,برجاء تسجيل الخروج ثم تسجيل الدخول مرة أخرى. إذا ظل كما هو برجاء حذف البرنامج وتنزيله مرة أخرى من على متجر play,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                    `ازيك يا كابتن,برجاء التواصل مع خدمة دعم الكابتن من خلال الرقم 02/38272849 والتأكد من توافق الإصدار مع الهاتف.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                    `ازيك يا كابتن,يرجى اتباع الاتى:,1) فتح برنامج (متجر play ) و البحث عن ( Android web view system ) ,2) تحديث البرنامج السابق ,3) برجاء تسجيل الخروج من البرنامج الان وأعاده فتحة بعد 5 دقائق ,وسوف تظهر صفحة الكابتن بكافة البيانات.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                    `ازيك يا كابتن,يرجى العلم أنه بعد مراجعة نوع السيارة ومقارنتها بقائمة السيارات المفعلة بفئة (GO+),ينوه على أنه تم تغير فئة السيارة من (GO) إلى (GO+) ونشكركم الثقة,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ]
            },
            "cap_transfer_and_updating_info": {
                "from car to scooter, from scooter to car issues": [
                    `ازيك يا كابتن,يرجى العلم أنه لإضافة دراجة نارية على قاعدة بيانات كريم يجب اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (إضافة/تحديث بيانات) ثم اختيار (إضافة سكوتر) ومن ثم رفع وتسجيل كلاً من (صورة من فحص الدراجة - الصورة الأمامية لرخصة الدراجة - الصورة الخلفية لرخصة الدراجة بالإضافة لصورة الرقم القومي),شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks ,`,
                    `ازيك يا كابتن,يرجى العلم أنه لإضافة سيارة على قاعدة بيانات كريم يجب اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (إضافة/تحديث بيانات) ثم اختيار (إضافة سيارة) ومن ثم رفع وتسجيل كلاً من (صورة من فحص السيارة - الصورة الأمامية لرخصة السيارة - الصورة الخلفية لرخصة السيارة بالإضافة لصورة الرقم القومي),شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks ,`,
                    `يرجى العلم أنه للتحويل من سيارة إلى سكوتر على قاعدة بيانات كريم يجب اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (تحويل كابتن) ثم اختيار (من سيارة إلى سكوتر) ومن ثم رفع وتسجيل كلاً من (نوع السكوتر - موديل السكوتر - صورة الرقم القومي من كلا الجهتين - صورة رخصة السكوتر من كلا الجهتين - صورة فحص السكوتر),شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "from default to supplier, from supplier to supplier": [
                    `ازيك يا كابتن,يرجى العلم أنه لن يتم تحويل الكابتن لمكتب (اسم المكتب) لعدم اكتمال شروط التحويل وهي كالآتي:,1- 60 رحلة في أول 20 يوم,2- تقيم الكابتن 4.6 أو أكثر,3- نسبة قبول 90% أو أكثر,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم موافقة مكتب (اسم المكتب) على تحويل الكابتن لمكتب (اسم المكتب) وتم بالفعل تحويله.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم تحويل الكابتن لمكتب (اسم المكتب) بناءاُ على رغبته.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن المكتب الحالي لم يوافق على طلب تحويل الكابتن لمكتب (اسم المكتب) وبناءاً عليه لن نقوم بالتحويل.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم انه لا يوجد تحويل من مكتب الى مباشر حسب سياسة الشركة المتعارف عليها ,شاكرين ثقتكم,كما يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة,https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم رفض مكتب (اسم المكتب) على تحويل الكابتن لمكتب (اسم المكتب) لذ لن تم التحويل.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ],
                "data updating issues": [
                    `ازيك يا كابتن,يرجى العلم أنه تم تحديث رقم الهاتف للكابتن ليبدأ بـ (رقم الهاتف),شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم تغير الرقم السري  للكابتن حسب رغبته ليبدأ بـ (رقم الهاتف).,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم تحويل سيارة الكابتن من فئة GO إلى فئة GO+ لتوافقها مع قائمة السيارات المقبولة بالفئة على قاعدة بيانات كريم.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم إضافة السيارة رقم (رقم السيارة)/السكوتر رقم (رقم السكوتر) بنجاح,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن, برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (إضافة/تحديث بيانات) ثم اختيار (تحديث/إضافة الصورة الشخصية) ومن ثم رفع كلاً من (صورة الرقم القومي من كلا الجهتين - الصورة المراد تحديثها).,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                    `, ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (مشكلة حسابات) ثم اختيار (المحفظة الذكية) ومن ثم تسجيل كلاً من (رقم الهاتف الخاص بالمحفظة - تاريخ انتهاء الدورة).,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks"`,
                    ` ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (إضافة/تحديث بيانات) ثم اختيار (تحديث رقم التليفون) ومن ثم رفع كلاً من (صورة الرقم القومي من كلا الجهتين - رقم التليفون الجديد).,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks"`,
                    ` ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (إضافة/تحديث بيانات) ثم اختيار (إضافة سيارة) ومن ثم رفع كلاً من (صورة الرخصة من كلا الجهتين - صورة فحص السيارة).,شكراً لثقتك,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "suggestions & others": [
                    `ازيك يا كابتن,يرجى العلم أن جميع مقترحاتكم وتخوفاتكم هي بالفعل قيد المناقشة والدراسة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أن هناك مشكلة في قاعدة بيانات كريم وسوف يتم حلها في خلال 48 ساعة. أن لم تحل المشكلة تلقائياً  يرجى إعادة إرسالها على نفس الإستمارة مرة أخرى.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أننا نعمل جاهدين لإرضاء جميع متطلباتكم و تم رفع الشكوى للقسم المختص للمراجعة والعمل عليها,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ]
            },
            "quality_issues": {
                "block issues" : [
                    `ازيك يا كابتن,يرجى العلم أنه تم وقف حساب الكابتن نهائياً بسبب الرحلات الوهمية المتكررة ولا يمكن عودته مرة أخرى.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم وقف حساب الكابتن بسبب قيامه بمخالفات لقواعد كريم. ,يرجى الانتظار وسوف يتم إرسال رسالة تحتوي على فيديو واختبار في خلال ساعات. برجاء فتح الرسالة ومشاهد الفيديو لآخره واتباع الخطوات حتى يتم فك الحظر.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,برجاء التواصل مع خدمة دعم الكابتن في المستقبل بعد تكرار العملاء  من خلال الرقم 02/38272849 والإبلاغ بالتكرار. كما يمكن حظر العميل المتكرر من خلال البرنامج بعد انتهاء الرحلة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم انه لفك حظر الكابتن بعد التوقف لفترة زمنية طويلة عن العمل يجب حضور الكابتن محاضرة جديدة حتى يتسنى لنا فك الحظر.,شكراً لثقتك ,كما يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة والدعم,https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم انه تم فك حظر الكابتن ويمكن الرجوع وممارسة العمل طبيعياً. ونرجو عدم تكرار المخالفات حتى لا يتم وقف الكابتن نهائياً ونشكركم الثقة,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم انه تم حظر السيارة رقم (رقم السيارة) بسبب كثرة الشكوى التي تخص الحالة العامة للسيارة. ولفك الحظر يرجى الدخول على الرابط التالي وارسال فحص حديث للسيارة موجه لشركة كريم في خلال 24 ساعة https://podio.com/webforms/19791605/1340645, ونشكركم الثقة,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن يرجى العلم انه يتم فك الحظر في مواعيد العمل الرسمية من الاحد الى الخميس من 10 ص و حتى ال 6 م في حال مشاهدة الفيديو كاملا و الاجابة على الاسئلة شاكرين ثقتكم كما يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة,https://goo.gl/FQgfks,`,
                ],
                "fine issues" : [
                    `ازيك يا كابتن,يرجى العلم أنه تم احتساب غرامة بقيمة 25% من العائد الكلي للكابتن بالدورة الحالية بسبب الرحلات الوهمية المتكررة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم احتساب غرامة بقيمة 25% من العائد الكلي للكابتن بالدورة الحالية و خصم البونص والجارانتي بسبب الرحلات الوهمية المتكررة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه تم احتساب غرامة بسبب عدم استكمال المستندات المطلوبة للعمل مع شركة كريم. لذا تم خصم 40 جنيه مصاريف الإستعلام الأمني الذي تقوم به الشركة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (مشاكل الجودة) ثم اختيار (مشكلة غرامة) ومن ثم تحديد نوع الغرامة (غرامة مرور) وتسجيل ورفع كلاً من (رقم الرحلة - تاريخ الغرامة - إيصال سحب الرخصة - إيصال الدفع) حتى تتم المراجعة من قبل القسم المختص وتعويض الكابتن.,شكراً لثقتك ,رجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks",,`,
                    `ازيك يا كابتن,يرجى العلم أن العميل له الحق في إلغاء الرحلة ما لم يمر عليها أكثر من 5 دقائق بعد قبولها من غير غرامة  عدا ذلك فسوف يتم احتساب غرامة على العميل بقيمة 10 جنيهات وسوف يتم احتساب تعويض للكابتن بقيمة 8 جنيهات,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,برجاء اعادة ارسال المشكلة مرة أخرى واختيار نوع المشكلة (مشاكل الجودة) ثم اختيار (مشكلة غرامة) ومن ثم تحديد نوع الغرامة (غرامة رحلة) وتسجيل (رقم الرحلة) حتى تتم المراجعة من قبل القسم المختص وتعويض الكابتن.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks`,
                ],
                "trip rating issue" : [
                    `ازيك يا كابتن,يرجى العلم أنه تم إزالة تقيم الرحلة رقم (رقم الرحلة) بعد مراجعتها من قبل قسم الجودة.,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,يرجى العلم أنه لن يتم إزالة تقيم الرحلة رقم (رقم الرحلة) حيث أنه من حق العميل تقيم الرحلة بالشكل الذي يراه والذي يمثل رضاه عن الرحلة هذا ما أن لم يكن هناك مشكلة بعينها في الرحلة. ,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `يرجى العلم أن هناك علاقة بين الغاء الرحلات ونسبة قبولها وكذلك تقيم العملاء للرحلات,لذا يرجى الحفاظ على نسبة القبول وعدم إلغاء رحلات بدون سبب والحرص على تحقيق الرحلات بأفضل شكل حتى يرتفع تقيم الكابتن العام ونشكركم الثقة,كما يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة: https://goo.gl/FQgfks`,
                    `كابتن كريم,سوف يتم مراجعة تقييم الرحلة  رقم ( ---- ) و سيتم ارسال الرد اليك في اسرع وقت ونشكركم الثقة,كما  يرجى الإجابة على استطلاع الرأي لمساعدتنا في تحسين خدمتنا :,https://goo.gl/FQgfks`,
                ],
                "issue with customers" : [
                    `ازيك يا كابتن,برجاء تحديد المشكلة بدقة وسردها بوضوح حتى يتسنى لنا حلها,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                    `ازيك يا كابتن,نعتذر بشدة عن ما حدث وبالفعل تم ارسال الشكوى الى القسم المختص,ويرجى العلم أنه يمكن عمل بلوك للعميل وتقييمه ايضاً وإرسال شكوى بالتعليق,شكراً لثقتك ,يرجى الإجابة على استطلاع الرأي التالي لمساعدتنا في تحسين جودة الخدمة:https://goo.gl/FQgfks,`,
                ]
            },
            "Quality Zendesk" : {
                "General Reply (Minor/ first time violator)" : [
                    `Case solved,Action: Case has been added to the cpt;s history, Once the cpt reaches a certain score of violation, He will be blocked for re-coaching`,
                ],
                "Cancellation" : [
                    `Case solved,Action: penalty will be added to the captain;s portal`
                ],
                "Cash Collection" : [
                    `Case solved,Action: Captain;s account is adjusted`,
                    `No action to be taken ,Reason: Cash is already deducted from cpt;s account`,
                    `No action to be taken,Reason: Captain added zero and trip cost equals what customer paid.. it was added negatively to captain;s portal , no need to raise a case`,
                ],
                "Case is not valid" : [`No action to be taken,Reason: case is not valid or verified on the GPS`]
            }
        },
        showCategories : true,
        showSubCategory : false,
        showIssues : false,
        selectedCat: '',
        selectedSubCat : ''
    },
    methods : {
        showSubCatMethod : function (cat) {
            this.selectedCat = cat
            this.showCategories = false;
            this.showSubCategory= true;
            this.showIssues = false

        },
        showIssuesMethod: function (subcat) {
            this.selectedSubCat = subcat
            this.showCategories = false;
            this.showSubCategory= false;
            this.showIssues = true;
        },
        selectAnIssue(issue){
            chrome.storage.local.get(['agentName','whereToFill'],function (data) {
                var fullReply = `${issue} , ${data.agentName}`,
                    whereToFill = data.whereToFill;
                chrome.tabs.query({active : true , currentWindow : true},function (tabs) {
                    chrome.tabs.executeScript(tabs[0].id,{
                        code : `
                            var publicReply = document.querySelectorAll('.editor.zendesk-editor--rich-text-comment p'),
                                replyToCaptain=[]; 

                            publicReply = Array.from(publicReply).filter(function(item){
                                return item.clientWidth !== 0;
                            });

                            document.querySelectorAll('label').forEach(function(i){
                                if(i.innerText == 'Reply to captain'){
                                    replyToCaptain.push(i)
                                }
                            });

                            replyToCaptain = Array.from(replyToCaptain).filter(function(item){
                                return item.clientWidth !== 0
                                ;
                            });

                            function last(arr){
                                return arr[arr.length-1];
                            }
                            publicReply= last(publicReply);
                            replyToCaptain= last(replyToCaptain);

                            if('${whereToFill}' === "replyToCaptain"){
                                replyToCaptain.nextElementSibling.value = '${fullReply}';
                                replyToCaptain.nextElementSibling.value = replyToCaptain.nextElementSibling.value.replace(/,/g , "\\r\\n");
                            }else{
                                publicReply.innerText= '${fullReply}';
                                publicReply.innerText = publicReply.innerText.replace(/,/g , "\\r\\n");
                                publicReply.innerText = publicReply.innerText.replace(/;/g , "'");
                            }`
                    });
                })
            })
        }
    }
})